FI/Ajanvaraustiedot/Integraatiopalvelu_Ajanvaraustiedot_Esimerkkisanoma_CancelAppointmet_Request_3.1.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:lif="Lifecare.Integration.ScheduleDataService" xmlns:lif1="Lifecare.Integration.Common.Contracts" xmlns:lif2="Lifecare.Integration.ScheduleDataService.Contracts">
   <soapenv:Header/>
   <soapenv:Body>
      <lif:CancelAppointmentRequest>
         <lif:MessageHeader>
               <lif1:MessageID>?</lif1:MessageID>
               <lif1:TransactionID>?</lif1:TransactionID>
               <lif1:SenderID>?</lif1:SenderID>
               <lif1:SenderApplication>IntegrationServices</lif1:SenderApplication>
               <lif1:ReceiverID>?</lif1:ReceiverID>
               <lif1:ReceiverApplication>?</lif1:ReceiverApplication>
               <lif1:CharacterSet>?</lif1:CharacterSet>
               <lif1:DataServiceURL>?</lif1:DataServiceURL>
               <lif1:UserLanguageCode>?</lif1:UserLanguageCode>
               <lif1:VersionNumber>?</lif1:VersionNumber>
         </lif:MessageHeader>
         <lif:Common>
               <lif1:ContractKey>aaaabbbbbcccccc</lif1:ContractKey>
               <lif1:CallingSystem>Keksi</lif1:CallingSystem>
               <lif1:Area>
                  <lif1:CodeSetName>Effica/Lifecare</lif1:CodeSetName>
                  <lif1:CodeSetId>?</lif1:CodeSetId>
                  <lif1:CodeValue>hhkes</lif1:CodeValue>
                  <lif1:CodeDescription>?</lif1:CodeDescription>
               </lif1:Area>
               <lif1:UserIdentifiers>
                  <lif1:UserIdentifier>
                     <lif1:UserIdentifierCodeId>EFFICA_USER_ID</lif1:UserIdentifierCodeId>
                     <lif1:UserIdentifierCode>hamtes</lif1:UserIdentifierCode>
                     <lif1:FamilyName>?</lif1:FamilyName>
                     <lif1:GivenNames>?</lif1:GivenNames>
                     <lif1:Profession>?</lif1:Profession>
                  </lif1:UserIdentifier>
               </lif1:UserIdentifiers>
               <lif1:Function>
                  <lif1:CodeSetName>Effica/Lifecare</lif1:CodeSetName>
                  <lif1:CodeSetId>?</lif1:CodeSetId>
                  <lif1:CodeValue>hammas</lif1:CodeValue>
                  <lif1:CodeDescription>?</lif1:CodeDescription>
               </lif1:Function>
               <lif1:ReasonCode>
                  <lif1:CodeSetName></lif1:CodeSetName>
                  <lif1:CodeSetId>?</lif1:CodeSetId>
                  <lif1:CodeValue>1</lif1:CodeValue>
                  <lif1:CodeDescription>?</lif1:CodeDescription>
               </lif1:ReasonCode>
         </lif:Common>
         <lif:CancelAppointment>
            <lif2:ScheduleId>
               <lif1:CodeSetName>?</lif1:CodeSetName>
               <lif1:CodeSetId>?</lif1:CodeSetId>
               <lif1:CodeValue>Integr</lif1:CodeValue>
               <lif1:CodeDescription>?</lif1:CodeDescription>
            </lif2:ScheduleId>
            <lif2:Function>
               <lif1:CodeSetName></lif1:CodeSetName>
               <lif1:CodeSetId>?</lif1:CodeSetId>
               <lif1:CodeValue>hammas</lif1:CodeValue>
               <lif1:CodeDescription>?</lif1:CodeDescription>
            </lif2:Function>
            <lif2:Area>
               <lif1:CodeSetName>Effica/Lifecare</lif1:CodeSetName>
               <lif1:CodeSetId>?</lif1:CodeSetId>
               <lif1:CodeValue>hhkes</lif1:CodeValue>
               <lif1:CodeDescription>?</lif1:CodeDescription>
            </lif2:Area>
            <lif2:AppointmentType>
               <lif1:CodeSetName>?</lif1:CodeSetName>
               <lif1:CodeSetId>?</lif1:CodeSetId>
               <lif1:CodeValue>hlvo</lif1:CodeValue>
               <lif1:CodeDescription>?</lif1:CodeDescription>
            </lif2:AppointmentType>
            <lif2:CustomerId>
               <lif2:Identifier>010210AA020</lif2:Identifier>
            </lif2:CustomerId>
            <lif2:Resource>
               <lif1:UserIdentifier>
                  <lif1:UserIdentifierCodeId>EFFICA_USER_ID</lif1:UserIdentifierCodeId>
                  <lif1:UserIdentifierCode>hamtes</lif1:UserIdentifierCode>
                  <lif1:FamilyName>?</lif1:FamilyName>
                  <lif1:GivenNames>?</lif1:GivenNames>
                  <lif1:Profession>?</lif1:Profession>
               </lif1:UserIdentifier>
            </lif2:Resource>
            <lif2:StartDateTime>2015-06-11T12:00:00</lif2:StartDateTime>
            <lif2:EndDateTime>2015-06-11T12:30:00</lif2:EndDateTime>
            <lif2:SlotId>95c8e758-8cf6-4347-9dbd-584487ba1769</lif2:SlotId>
            <lif2:LateCancellation>false</lif2:LateCancellation>
            <lif2:ReasonForLateCancellation>Ei huvittanut lähteä</lif2:ReasonForLateCancellation>
         </lif:CancelAppointment>
      </lif:CancelAppointmentRequest>
   </soapenv:Body>
</soapenv:Envelope>